#!/bin/bash
# @Time        :2020/6/28 下午11:33
# @Author      :passerby223
# @Description :

# 使用`read`设置用户输入，使用`-p`打印提示信息,`read`命令后边跟变量来保存用户输入
read -p "请输入姓名>>>" name
read -p "请输入年龄>>>" age
read -p "请输入性别>>>" gender
echo "***********************************分割线***********************************"
echo "当前shell脚本名为:$0, 当前shell脚本命令行参数个数为:$#, 当前shell脚本的所有命令行参数为:$*"
echo "***********************************分割线***********************************"
greet() {
  echo -e "你好,我的名字是$1,年龄是$2,性别是$3.\n当前shell脚本名为:$0, 当前greet()方法接收到的实参个数为:$#个, 当前greet()方法接收到的实参分别为:$*"
}
# 调用函数并传参
greet ${name} ${age} ${gender}
